CSI API ETABS v1
cLinkObj.GetTransformationMatrix Method
 Retrieves the transformation matrix for a link object.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTransformationMatrix(
	string Name,
	ref double[] Value,
	bool IsGlobal = true
)
Function GetTransformationMatrix (
	Name As String,
	ByRef Value As Double(),
	Optional IsGlobal As Boolean = true
) As Integer
Dim instance As cLinkObj
Dim Name As String
Dim Value As Double()
Dim IsGlobal As Boolean
Dim returnValue As Integer
returnValue = instance.GetTransformationMatrix(Name,
	Value, IsGlobal)
int GetTransformationMatrix(
	String^ Name,
	array<double>^% Value,
	bool IsGlobal = true
)
abstract GetTransformationMatrix :
        Name : string *
        Value : float[] byref *
        ?IsGlobal : bool
(* Defaults:
        let _IsGlobal = defaultArg IsGlobal true
*)
-> int
Parameters
Name
Type: System.String
The name of an existing link object.
Value
Type: System.Double[]
Value is an array of nine direction cosines that define the transformation matrix.
The following matrix equation shows how the transformation matrix is used to convert items from the link object local coordinate system to the global coordinate system.
c0 c1 c2| |Local1| |GlobalX
c3 c4 c5| * |Local2| = |GlobalY
c6 c7 c8| |Local3| |Globalz
In the equation, c0 through c8 are the nine values from the transformation array, (Local1, Local2, Local3) are an item (such as a load) in the object local coordinate system, and (GlobalX, GlobalY, GlobalZ) are the same item in the global coordinate system.
The transformation from the local coordinate system to the present coordinate system is the same as that shown above for the global system if you substitute the present system for the global system.
IsGlobal (Optional)
Type: System.Boolean
If this item is True, the transformation matrix is between the Global coordinate system and the link object local coordinate system. If this item is False, the transformation matrix is between the present coordinate system, and the link object local coordinate system.
Return Value
Type: Int32
Returns zero if the link object transformation matrix is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
       Dim Value() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link object by points
       ret = SapModel.LinkObj.AddByPoint("1", "5", Name)
   'get link object transformation matrix
       ReDim Value(8)
       ret = SapModel.LinkObj.GetTransformationMatrix(Name, Value)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLinkObj Interface
ETABSv1 Namespace